#  <font color=red> Module_05_資料的載入與儲存</font>

## 處理CSV及文字、表格格式的資料

In [1]:
import pandas as pd
import numpy as np
from datetime import datetime
import sys
import json 
import pickle

msft = pd.read_csv('./mod05/msft.csv')
msft[:5]

        Date   Open   High    Low  Close   Volume
0  7/21/2014  83.46  83.53  81.81  81.93  2359300
1  7/18/2014  83.30  83.40  82.52  83.35  4020800
2  7/17/2014  84.35  84.63  83.33  83.63  1974000
3  7/16/2014  83.77  84.91  83.66  84.91  1755600
4  7/15/2014  84.30  84.38  83.20  83.58  1874700

指定索引行是第幾行，從 0 開始算起
當然也可以讀進來後再用 .set_index() 方法

In [2]:
msft = pd.read_csv('./mod05/msft.csv', index_col = 0) 
msft[:5]

            Open   High    Low  Close   Volume
Date
7/21/2014  83.46  83.53  81.81  81.93  2359300
7/18/2014  83.30  83.40  82.52  83.35  4020800
7/17/2014  84.35  84.63  83.33  83.63  1974000
7/16/2014  83.77  84.91  83.66  84.91  1755600
7/15/2014  84.30  84.38  83.20  83.58  1874700

In [3]:
msft.dtypes

Open      float64
High      float64
Low       float64
Close     float64
Volume      int64
dtype: object

dtype 可能不是我們要的資料型態

In [4]:
msft.index

Index(['7/21/2014', '7/18/2014', '7/17/2014', '7/16/2014', '7/15/2014',
       '7/14/2014', '7/11/2014', '7/10/2014', '7/9/2014', '7/8/2014',
       ...
       '1/14/2000', '1/13/2000', '1/12/2000', '1/11/2000', '1/10/2000',
       '1/7/2000', '1/6/2000', '1/5/2000', '1/4/2000', '1/3/2000'],
      dtype='object', name='Date', length=3767)

可以利用 dtype 參數來決定每一欄的資料型態，寫成字典
字典的值通常寫 np.float64 或字串 'float' 都能夠成功

In [5]:
msft = pd.read_csv('./mod05/msft.csv', dtype = {'Volume': np.float64}) 
msft.dtypes

Date       object
Open      float64
High      float64
Low       float64
Close     float64
Volume    float64
dtype: object

預設是 header = 'infer'
試試看改成 header = None，header = 0，header = 1 的差別

In [11]:
df = pd.read_csv('./mod05/msft.csv', 
                 header = 0, 
                 names = ['date', 'open', 'high', 'low', 'close', 'volume']) 
df[:5]

        date   open   high    low  close   volume
0  7/21/2014  83.46  83.53  81.81  81.93  2359300
1  7/18/2014  83.30  83.40  82.52  83.35  4020800
2  7/17/2014  84.35  84.63  83.33  83.63  1974000
3  7/16/2014  83.77  84.91  83.66  84.91  1755600
4  7/15/2014  84.30  84.38  83.20  83.58  1874700

用 userclos 參數指定載入特定的行
這裡一定要載入 Date，因為我們要把他設定成索引標籤

In [12]:
df2 = pd.read_csv('./mod05/msft.csv', 
                    usecols = ['Date', 'Close'],
                    index_col = ['Date']) 
df2[:5]

           Close
Date
7/21/2014  81.93
7/18/2014  83.35
7/17/2014  83.63
7/16/2014  84.91
7/15/2014  83.58

用 .to_csv() 方法把 dataFrame 存成 csv
如果索引標籤沒有名字，可以用參數 index_label 給索引標籤取名

In [13]:
df2.to_csv('./mod05/msft_modified.csv', index_label = 'Date')

---

可以用參數 sep 來指定資料是用什麼符號來分隔欄位
也可以用 pd.read_table('./mod05/msft.csv', sep =',')，一模一樣的效果

In [14]:
df = pd.read_csv('./mod05/msft.csv', sep = ',') 
df

           Date   Open   High    Low  Close   Volume
0     7/21/2014  83.46  83.53  81.81  81.93  2359300
1     7/18/2014  83.30  83.40  82.52  83.35  4020800
2     7/17/2014  84.35  84.63  83.33  83.63  1974000
3     7/16/2014  83.77  84.91  83.66  84.91  1755600
4     7/15/2014  84.30  84.38  83.20  83.58  1874700
...         ...    ...    ...    ...    ...      ...
3762   1/7/2000  48.55  50.35  47.80  50.00  4621200
3763   1/6/2000  46.78  48.35  46.28  48.03  3306100
3764   1/5/2000  46.94  47.50  45.92  46.75  4809900
3765   1/4/2000  49.80  49.80  47.72  47.85  4489500
3766   1/3/2000  52.70  53.20  49.60  49.75  3137300

[3767 rows x 6 columns]

用 .to_csv() 方法把 dataFrame 存成用 | 隔開的文字檔
用參數 index 來決定要不要存 index

In [15]:
df.to_csv('./mod05/msft.piped.txt', sep = '|', index = False)

再讀回來

In [16]:
df = pd.read_csv('./mod05/msft.piped.txt', sep = '|')
df[:5]

        Date   Open   High    Low  Close   Volume
0  7/21/2014  83.46  83.53  81.81  81.93  2359300
1  7/18/2014  83.30  83.40  82.52  83.35  4020800
2  7/17/2014  84.35  84.63  83.33  83.63  1974000
3  7/16/2014  83.77  84.91  83.66  84.91  1755600
4  7/15/2014  84.30  84.38  83.20  83.58  1874700

---

使用參數 skiprows 來排除額外的頁眉

In [17]:
df = pd.read_csv('./mod05/msft2.csv', skiprows = [0, 2, 3])
df

        Date   Open   High    Low  Close   Volume
0  7/21/2014  83.46  83.53  81.81  81.93  2359300
1  7/18/2014  83.30  83.40  82.52  83.35  4020800
2  7/17/2014  84.35  84.63  83.33  83.63  1974000
3  7/16/2014  83.77  84.91  83.66  84.91  1755600
4  7/15/2014  84.30  84.38  83.20  83.58  1874700
5  7/14/2014  83.66  84.64  83.11  84.40  1432100
6  7/11/2014  83.55  83.98  82.85  83.35  2001400
7  7/10/2014  85.20  85.57  83.36  83.42  2713300
8   7/9/2014  84.83  85.79  84.76  85.50  1540700

用參數 skipfooter 來排除額外的檔尾，skipfooter = 2 表示最後兩列要被排除
要加 engine = 'python'

In [18]:
df = pd.read_csv('./mod05/msft_with_footer.csv', 
                 skipfooter = 2,
                 engine = 'python')   
df

        Date   Open   High    Low  Close   Volume
0  7/21/2014  83.46  83.53  81.81  81.93  2359300
1  7/18/2014  83.30  83.40  82.52  83.35  4020800

有時檔案太大，只想讀前面幾列
用參數 nrows 來決定讀取前幾列

In [19]:
pd.read_csv('./mod05/msft.csv', nrows = 3)

        Date   Open   High    Low  Close   Volume
0  7/21/2014  83.46  83.53  81.81  81.93  2359300
1  7/18/2014  83.30  83.40  82.52  83.35  4020800
2  7/17/2014  84.35  84.63  83.33  83.63  1974000

In [20]:
pd.read_csv('./mod05/msft.csv', 
            skiprows = 2, 
            nrows = 3,
            header = 0,
            names = ['date', 'open', 'high', 'low', 'close', 'volume']) # 注意流程有沒有跟妳想的一樣

        date   open   high    low  close   volume
0  7/17/2014  84.35  84.63  83.33  83.63  1974000
1  7/16/2014  83.77  84.91  83.66  84.91  1755600
2  7/15/2014  84.30  84.38  83.20  83.58  1874700

---

In [21]:
df = pd.read_csv('./mod05/ex1.csv')
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

pd.read_table() 函式預設的 sep 是空格
可以把 sep 拿掉看看差別

In [22]:
df = pd.read_table('./mod05/ex1.csv', sep = ',') 
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [23]:
df = pd.read_table('./mod05/ex1.csv') 
df

  a,b,c,d,message
0   1,2,3,4,hello
1   5,6,7,8,world
2  9,10,11,12,foo

In [24]:
df = pd.read_csv('./mod05/ex2.csv', header = None) # 說明檔案沒有標頭
df

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [25]:
df = pd.read_csv('./mod05/ex2.csv', header = None, names = ['a', 'b', 'c', 'd', 'message']) 
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [26]:
df =pd.read_csv('./mod05/csv_mindex.csv', index_col = ['key1', 'key2']) # 階層式索引
df

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

使用正規表達式
試試看 sep = ' ' 會如何
因為第 0 欄沒名字被當成索引

In [27]:
df = pd.read_table('./mod05/ex3.txt', sep = '\s+') 
df

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [28]:
df = pd.read_table('./mod05/ex3.txt', sep = ' ') 
df

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,...,B,Unnamed: 22,Unnamed: 23,Unnamed: 24,Unnamed: 25,Unnamed: 26,Unnamed: 27,Unnamed: 28,Unnamed: 29,C
0,aaa,-0.264438,-1.026059,-0.619500,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,bbb,NaN,0.927272,NaN,0.302904,-0.032399,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,ccc,-0.264273,-0.386314,-0.217601,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,ddd,-0.871858,-0.348382,NaN,1.100491,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

---

pandas 對遺失值的標記
如果是 NA 或是都沒輸入會顯示 NaN
注意空格會被認為是空格字串，而不是遺失值

In [29]:
df = pd.read_csv('./mod05/ex5.csv') 
df

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [30]:
df.isnull()

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [31]:
# 可以用 na_values 參數來自定義那些值也是遺失值
df = pd.read_csv('./mod05/ex5.csv', na_values = ['NULL', 'foo']) # NULL 和 foo 也要當遺失值
df

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

In [32]:
 # 對每個欄指定不同的 NA 標記值
df = pd.read_csv('./mod05/ex5.csv', na_values = {'message': ['foo', 'NA'], 'something': ['two']})
df

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

---

In [33]:
# 如果數據超大，可用 chunksize 分段讀取
chunker = pd.read_csv('./mod05/ex6.csv', chunksize = 1000) # 分段讀取檔案
chunker

In [34]:
tot = pd.Series([], dtype = 'float64')
tot

Series([], dtype: float64)

In [35]:
for piece in chunker:
    tot = tot.add(piece['key'].value_counts(), fill_value = 0)
    
tot = tot.sort_values(ascending = False) 
tot

E    368.0
X    364.0
L    346.0
O    343.0
Q    340.0
M    338.0
J    337.0
F    335.0
K    334.0
H    330.0
V    328.0
I    327.0
U    326.0
P    324.0
D    320.0
A    320.0
R    318.0
Y    314.0
G    308.0
S    308.0
N    306.0
W    305.0
T    304.0
B    302.0
Z    288.0
C    286.0
4    171.0
6    166.0
7    164.0
8    162.0
3    162.0
5    157.0
2    152.0
0    151.0
9    150.0
1    146.0
dtype: float64

---

In [36]:
data = pd.read_csv('./mod05/ex5.csv')
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [37]:
data.to_csv(sys.stdout, sep = '|') # 寫到 sys.stdout，這樣會把文字改為顯示在終端機上

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [38]:
# 把遺失值用 'Null' 輸出
# na_rep 就是 A string representation of a missing value 
data.to_csv(sys.stdout, sep = '|', na_rep = 'Null')

|something|a|b|c|d|message
0|one|1|2|3.0|4|Null
1|two|5|6|Null|8|world
2|three|9|10|11.0|12|foo

In [39]:
data.to_csv(sys.stdout, index = False, header = False)

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

In [40]:
data.to_csv(sys.stdout, index = False, columns = ['a', 'b', 'c']) # 只寫出部分的欄位

a,b,c
1,2,3.0
5,6,
9,10,11.0

---

In [ ]:
dates = pd.date_range('2000/1/1', periods = 7)
ts = pd.Series(np.arange(7), index = dates)
ts

In [ ]:
ts.to_csv('./mod05/tseries.csv') # 序列一樣有 .to_csv() 方法可用

## 讀寫 Excel 格式資料

In [ ]:
# 需要安裝 xlrd、openpyxl 套件來讀 XLS 及 XLSX 檔案 
# XLSX 檔案是比較新的格式，通常都會把 Excel 存成 .xlsx 檔
df = pd.read_excel('./mod05/stocks.xlsx') 
df

In [ ]:
# 很多參數跟 pd.read_csv() 一樣，就不重複
aapl = pd.read_excel('./mod05/stocks.xlsx', sheet_name = 'aapl') # 讀取其他頁面 
aapl[:5]

---

In [ ]:
# 寫出需要 pip install XLWT
# 盡量不要存成 xls
# 存成 .xlsx 檔用 notepad++ 打開會亂碼
df.to_excel('./mod05/stock2.xlsx')

In [ ]:
df.to_excel('./mod05/stock_msft.xlsx', sheet_name = 'MSFT', index = False)

In [ ]:
# 寫入多頁面
with pd.ExcelWriter('./mod05/all_stocks.xlsx') as writer:
    aapl.to_excel(writer, sheet_name = 'AAPL')
    df.to_excel(writer, sheet_name = 'MSFT')

## 讀寫 JSON 檔案

In [41]:
df = pd.read_excel('./mod05/stocks.xlsx')
df[:5]

        Date   Open   High    Low  Close   Volume
0 2014-07-21  83.46  83.53  81.81  81.93  2359300
1 2014-07-18  83.30  83.40  82.52  83.35  4020800
2 2014-07-17  84.35  84.63  83.33  83.63  1974000
3 2014-07-16  83.77  84.91  83.66  84.91  1755600
4 2014-07-15  84.30  84.38  83.20  83.58  1874700

In [42]:
# 注意存成 json 檔後的長相
df.to_json('./mod05/stocks.json')

In [43]:
df_from_json = pd.read_json('./mod05/stocks.json') # json 具有跨平台與程式語言的可攜性
df_from_json[:5]

        Date   Open   High    Low  Close   Volume
0 2014-07-21  83.46  83.53  81.81  81.93  2359300
1 2014-07-18  83.30  83.40  82.52  83.35  4020800
2 2014-07-17  84.35  84.63  83.33  83.63  1974000
3 2014-07-16  83.77  84.91  83.66  84.91  1755600
4 2014-07-15  84.30  84.38  83.20  83.58  1874700

---

In [44]:
# 注意讀出來資料框的長相
data = pd.read_json('./mod05/example.json')
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [45]:
data.to_json('./mod05/data.json')

In [46]:
# 設定 orient = 'records'，會輸出另一種 json 格式
data.to_json('./mod05/data1.json', orient = 'records')

---

In [47]:
df = pd.DataFrame(np.array([[1, 2], [3, 4]]), 
                  index = ['a', 'b'],
                  columns = ['col1', 'col2'])
df

   col1  col2
a     1     2
b     3     4

In [48]:
df.to_json('./mod05/test.json')

In [50]:
# orient = 'records' 不會存入索引標籤
df.to_json('./mod05/test1.json', orient = 'records')

---

In [51]:
# All arrays must be of the same length
# 不是 json 檔就一定可以讀成 Dataframe
pd.read_json('./mod05/cv.json')

ValueError: All arrays must be of the same length

In [52]:
# 利用 json 套件來處理
with open('./mod05/cv.json', mode = 'r', encoding = 'utf-8') as f:
    content = f.read()
    
my_dict = json.loads(content)
my_dict

{'name': 'Wes',
 'places_lived': ['United States', 'Spain', 'Germany'],
 'pet': 1,
 'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [53]:
type(my_dict)

dict

In [54]:
# 每個欄位不一樣長的話沒辦法一次讀取成 dataframe
# 要分開讀成 dataFrame，再用 pd.concat() 或 pd.merge() 函式等等來合併
siblings = pd.DataFrame(my_dict['siblings']) 
siblings

    name  age                    pets
0  Scott   30            [Zeus, Zuko]
1  Katie   38  [Sixes, Stache, Cisco]

---

In [55]:
# 常見的應用，把個人檔案建成資料框
cv_json = []
cvs = ['cv', 'cv1', 'cv2']
for each in cvs:
    with open(f'./mod05/{each}.json', mode = 'r', encoding='utf-8') as f:
        content = f.read()
        content = json.loads(content)
        cv_json.append(content)

In [56]:
cv_json

[{'name': 'Wes',
  'places_lived': ['United States', 'Spain', 'Germany'],
  'pet': 1,
  'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
   {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]},
 {'name': 'Matt',
  'places_lived': ['Taiwan', 'Taipei'],
  'pet': 2,
  'siblings': [{'name': 'Alice', 'age': 30, 'pets': ['Apple']},
   {'name': 'Mary', 'age': 31, 'pets': ['A', 'B', 'C']}]},
 {'name': 'Crystal',
  'places_lived': ['Taiwan', 'Taichung'],
  'pet': None,
  'siblings': [{'name': 'Alex', 'age': 35, 'pets': ['Orange']},
   {'name': 'Ma', 'age': 50, 'pets': ['D', 'E']}]}]

In [57]:
for i, each in enumerate(cv_json):
    each['id'] = i

In [58]:
cv_json

[{'name': 'Wes',
  'places_lived': ['United States', 'Spain', 'Germany'],
  'pet': 1,
  'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
   {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}],
  'id': 0},
 {'name': 'Matt',
  'places_lived': ['Taiwan', 'Taipei'],
  'pet': 2,
  'siblings': [{'name': 'Alice', 'age': 30, 'pets': ['Apple']},
   {'name': 'Mary', 'age': 31, 'pets': ['A', 'B', 'C']}],
  'id': 1},
 {'name': 'Crystal',
  'places_lived': ['Taiwan', 'Taichung'],
  'pet': None,
  'siblings': [{'name': 'Alex', 'age': 35, 'pets': ['Orange']},
   {'name': 'Ma', 'age': 50, 'pets': ['D', 'E']}],
  'id': 2}]

In [59]:
info_col = ['id', 'name', 'places_lived', 'pet']
person = pd.DataFrame(cv_json, columns = info_col)
person

   id     name                     places_lived  pet
0   0      Wes  [United States, Spain, Germany]  1.0
1   1     Matt                 [Taiwan, Taipei]  2.0
2   2  Crystal               [Taiwan, Taichung]  NaN

In [60]:
person.pet = person.pet.fillna(0)
person

   id     name                     places_lived  pet
0   0      Wes  [United States, Spain, Germany]  1.0
1   1     Matt                 [Taiwan, Taipei]  2.0
2   2  Crystal               [Taiwan, Taichung]  0.0

In [61]:
pieces = []
for each in cv_json:
    sib = pd.DataFrame(each['siblings'])
    sib['id'] = each['id']
    pieces.append(sib)

In [62]:
pieces

[    name  age                    pets  id
 0  Scott   30            [Zeus, Zuko]   0
 1  Katie   38  [Sixes, Stache, Cisco]   0,
     name  age       pets  id
 0  Alice   30    [Apple]   1
 1   Mary   31  [A, B, C]   1,
    name  age      pets  id
 0  Alex   35  [Orange]   2
 1    Ma   50    [D, E]   2]

In [63]:
siblings = pd.concat(pieces)
siblings

    name  age                    pets  id
0  Scott   30            [Zeus, Zuko]   0
1  Katie   38  [Sixes, Stache, Cisco]   0
0  Alice   30                 [Apple]   1
1   Mary   31               [A, B, C]   1
0   Alex   35                [Orange]   2
1     Ma   50                  [D, E]   2

In [64]:
siblings.columns = ['sib_name', 'sib_age', 'sib_pet', 'id']
siblings

  sib_name  sib_age                 sib_pet  id
0    Scott       30            [Zeus, Zuko]   0
1    Katie       38  [Sixes, Stache, Cisco]   0
0    Alice       30                 [Apple]   1
1     Mary       31               [A, B, C]   1
0     Alex       35                [Orange]   2
1       Ma       50                  [D, E]   2

In [65]:
# 就類似資料庫的 MySQL
pd.merge(person, siblings)

,id,name,places_lived,pet,sib_name,sib_age,sib_pet
0,0,Wes,"[United States, Spain, Germany]",1.0,Scott,30,"[Zeus, Zuko]"
1,0,Wes,"[United States, Spain, Germany]",1.0,Katie,38,"[Sixes, Stache, Cisco]"
2,1,Matt,"[Taiwan, Taipei]",2.0,Alice,30,[Apple]
3,1,Matt,"[Taiwan, Taipei]",2.0,Mary,31,"[A, B, C]"
4,2,Crystal,"[Taiwan, Taichung]",0.0,Alex,35,[Orange]
5,2,Crystal,"[Taiwan, Taichung]",0.0,Ma,50,"[D, E]"

## 從網站讀取 HTML 資料

In [ ]:
# 需要 lxml、html5lib、BeautifulSoup4 套件
# 可以抓取 url 上的列表，但不是每個網站都能成功
# 不行只能爬蟲
url = "https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/"
banks = pd.read_html(url)

In [ ]:
len(banks) # 回傳一至多個 Dataframe 物件，傳回 Dataframe 的列表 (依照 Html 裡面有多少表格而定)

In [ ]:
banks

In [ ]:
failures = banks[0]
failures

In [ ]:
failures.dtypes

In [ ]:
 # 也可以用 pd.to_datetime() 函式，後面會教到
close_timestamps = failures['Closing DateClosing'].astype('datetime64[ns]')
close_timestamps

In [ ]:
close_timestamps.dt.year

In [ ]:
# 每年的破產銀行個數
close_timestamps.dt.year.value_counts()

---

In [ ]:
df = pd.read_excel('./mod05/stocks.xlsx')
df[:5]

In [ ]:
df[:5].to_html('./mod05/stocks.html') # 會為資料產生只擁有 <table> 標籤的檔案

## 讀寫 Pickle 格式檔案

In [ ]:
# 是一種儲存二進位格式資料 (也稱為序列化 serialization)
frame = pd.read_csv('./mod05/ex1.csv')
frame

In [ ]:
frame.to_pickle('./mod05/frame_pickle')

In [ ]:
pd.read_pickle('./mod05/frame_pickle') # 也可以用之前學過的方式，用內建的 pickle 讀取檔案中任何被 pickle 的物件

---

In [ ]:
# + 表示可讀寫的意思
file_pickle = open('./mod05/frame_pickle', mode = 'rb+')
frame_from_pickle = pickle.load(file_pickle)
file_pickle.close()

In [ ]:
frame_from_pickle

## 讀寫 HDF5 格式檔案

In [ ]:
# HDF5 也是常見的一種二進位檔案格式，另一個是 MessagePack
np.random.seed(123456)
df= pd.DataFrame(np.random.randn(8, 3), 
                 index = pd.date_range('1/1/2020', periods = 8),
                 columns = ['A', 'B', 'C'])
df

In [ ]:
# 需要用管理者開啟 CMD 安裝 tables 套件
# 把右邊的資料框 df 存進 store 裡，key 為 df 
store = pd.HDFStore('./mod05/store.h5')
store['df'] = df

In [ ]:
store.keys()

---

In [ ]:
store = pd.HDFStore('./mod05/store.h5')
store.keys()

In [ ]:
frame = store['df']
frame[:5]

In [ ]:
# 把 frame 做點修改再存進去 store
frame.iloc[0]['A'] = 1
frame

In [ ]:
store['df'] = frame

---

In [ ]:
# 再從 store 取出看有沒有更新
# 快速的寫法
pd.HDFStore('./mod05/store.h5')['df'][:5]

In [ ]:
# 最後要把 store 關閉
store.close()

---

In [ ]:
frame = pd.DataFrame({'a': np.random.randn(100)})
frame[:5]

In [ ]:
store = pd.HDFStore('./mod05/mydata.h5')

In [ ]:
store

In [ ]:
# 小心本來有檔案在裡面，是有可能重複存的
store.keys()

In [ ]:
# 這是資料框
store['obj1'] = frame

In [ ]:
# 這是序列
store['obj1_col'] = frame['a']

In [ ]:
store.keys()

In [ ]:
store['obj1']

In [ ]:
del store['obj1']

In [ ]:
store.keys()

In [ ]:
# 是 store['obj1'] = frame 的顯式寫法，可以讓我們指定像是儲存格式等參數
# HDFStore 支援 'fixed' 與 'table' 兩種儲存方式，後者慢一點，但它支援特殊的查詢語法
# 把之前的資料框存進 store，key 為 obj1
store.put('obj1', frame, format = 'table')

In [ ]:
store.keys()

In [ ]:
store.select('obj1', where = ['index >= 10 and index <= 15'])

In [ ]:
store.close()

---

In [ ]:
# 上面的更精簡寫法
frame.to_hdf('./mod05/mydata.h5', 'obj2', format = 'table')

In [ ]:
pd.read_hdf('./mod05/mydata.h5', 'obj2', where = ['index < 5'] )

## 存取網站上的 CSV 資料

In [ ]:
# 用 Python 來抓取政府公開資料(CSV)
# 不是一定會成功
frame = pd.read_csv("https://data.nhi.gov.tw/Datasets/Download.ashx?rid=A21030000I-D50001-001&l=https://data.nhi.gov.tw/resource/mask/maskdata.csv")
frame[:5]

## 從遠端資料服務讀取資料

# pandas-datareder 套件提供讀取許多有用資料源之功能
# 這包括使用 yahoo! 讀取每天的歷史股價
# 沒有此套件要 pip install pandas-datareder

In [ ]:
import pandas_datareader as pdr
start = datetime(2017, 4, 1)
end = datetime(2017, 4, 30)
df_msft = pdr.data.DataReader("MSFT", data_source = "yahoo", start = start, end = end)

In [ ]:
df_msft

In [ ]:
start = datetime(2010, 1, 1)
df_2330 = pdr.data.DataReader("2330.TW", "yahoo", start = start)

In [ ]:
df_2330

## 存取 MySQL 資料庫

# 利用 sqlalchemy 套件，從 MySQL 資料庫讀出資料寫成資料框

In [ ]:
from sqlalchemy import create_engine

# 先安裝套件 sqlalchemy
# 連接資訊務必要打對!
# 'mysql+module://username:password@ip:port/dbname?charset=utf8mb4'
connect_info = 'mysql+pymysql://root:妳的密碼@localhost:3306/testdb?charset=utf8mb4'

# 使用 sqlalchemy 去建立連接引擎 (link-engine)
engine = create_engine(connect_info) 


sql = "SELECT * FROM staff" # SQL 語法
df = pd.read_sql(sql = sql, 
                 con = engine, 
                 parse_dates = 'recordDt')

In [ ]:
df

In [ ]:
# 讀進資料框的每欄位的資料型態是 pandas 觀察出的，不一定是你要的資料型態
df.dtypes

In [ ]:
df['ID'] = df['ID'].astype('int')
df['Name'] = df['Name'].astype('S10')
df['DeptId'] = df['DeptId'].astype('int')

In [ ]:
df.dtypes

---

# 利用 sqlalchemy 套件，把資料框寫進 MySQL 資料庫

In [ ]:
from sqlalchemy import create_engine
from sqlalchemy.types import NVARCHAR, Float, Integer

# 'mysql+module://username:password@ip:port/dbname?charset=utf8mb4'
connect_info = 'mysql+pymysql://root:妳的密碼@localhost:3306/testdb?charset=utf8mb4'
engine = create_engine(connect_info) # 使用 sqlalchemy 去建立連接引擎 (link-engine)

In [ ]:
# 隨便建一個資料框，準備存入 MySQL
df = pd.DataFrame([['a', 1, 2.0, datetime.now(), True]], 
                   columns = ['str', 'int', 'float', 'datetime', 'boolean'])
df

In [ ]:
# 把資料框寫入 MySQL 
# name 是寫入的表格名
# 不管是寫出寫入都要注意每個欄位資料型態的改變
# 指定欄位的資料型態
df.to_sql(name = 'data_from_df',  
           con = engine,
           if_exists = 'append',
           index = False,
           dtype= {'str': NVARCHAR(length = 255),
                   'int': Integer(),
                   'float':Float()
                    })